[
    {
        "categoryId": "aerial",
        "category": "Aerial",
        "tricks": [
            {
                "id": "aerial-180",
                "trickName": "180",
                "trickDescription": "In general use, the term \"180\" is an aerial where the skater and board spin a half rotation. In common use, the term refers to an Ollie 180 performed on flat terrain, where the skater starts rolling forward, Ollies, turns a half rotation, and lands backwards. The same trick can be done on a bank, transition, or vert wall, but the difference is that the skater lands forwards. This is usually called a Frontside Ollie or Backside Ollie depending on the direction of rotation. A backside 180 started from fakie is called half-Cab as it's half the rotation of a Caballerial (see below).\n"
            },
            {
                "id": "aerial-360",
                "trickName": "360",
                "trickDescription": "An air where the rider and board spin one full rotation.  Can be performed almost anywhere whether it be on vert or street.  On vert, this is most commonly performed from fakie so that the rider completes the 360 facing forward.  Jeff Phillips was one of the first skaters to perform this while landing fakie (usually doing a lien grab).\n"
            },
            {
                "id": "aerial-540",
                "trickName": "540",
                "trickDescription": "A 540 is an aerial where skater and board spin one and a half rotations in midair. They were first performed on vertical ramps and quickly became a staple of vertical skateboarding at the professional level, but they have also been performed on box jumps, pyramids, down stairs, and even on mini-halfpipes. In the early 80s, Billy Ruff invented the Unit, the precursor to the modern 540. He'd early-grab the front rail and twist frontside, briefly putting his other hand down on the transition in order to push off the wall, which made it easier to get the whole spin. Because he had to put his hand down, the Unit was always done below the coping. In 1984[1] Tony Hawk took it to the next level when he invented the Frontside 540 (the inverted version of which is now known as the \"Rodeo Flip\"). But soon after, for some reason he lost the trick, and it didn't gain any sort of popularity until much later. In 1984, Mike McGill, then a pro skater for Powell, invented the McTwist, which is easily the most popular 540 variation ever (see below). A flood of variations soon followed, including almost every conceivable grab while spinning either direction, no grabs at all (Ollie 540), as well as versions combined with a Varial, Kickflip, or Heelflip.\n"
            },
            {
                "id": "aerial-720",
                "trickName": "720",
                "trickDescription": "The 720, two full mid-air rotations, is one of the rarest tricks in skateboarding. It was first done by Tony Hawk in 1985, and it wasn't something he planned to do. He accidentally over-rotated a Gay Twist and Lance Mountain suggested that he might be able to spin twice. After less than an hour, he landed it and has done it consistently ever since.[2] Like a Gay Twist, 720s are usually done from fakie grabbing Mute Air, but there have been a few different variations. Besides inventing the stock 720, Hawk also was the first to do Stalefish and Varial variations. Danny Way was the first to do indy 720s. Colin McKay and Jake Brown have both done Tailgrab 720s. Shaun White and Mitchie Brusco do a Backside Grab 720 consistently, and Matt Dove landed a spectacular pop shuv-it indy 720 at the 2001 X-Games.  Bucky Lasek has landed an indy grab forward to fakie backside variation, while Mike Callahan, a former pro from Chicago, has been known to do a frontside unit 720 variation.\n"
            },
            {
                "id": "aerial-900",
                "trickName": "900",
                "trickDescription": "The rider spins 900 degrees backside in the air, usually while grabbing Mute Air. It is arguably the most widely covered trick in the history of skateboarding, as Tony Hawk landed it for the first time at the 1999 X-Games following the best trick competition. The celebration on the ramp quickly snowballed into newspaper and television coverage which helped make Tony Hawk a household name. Five years later, Giorgio Zattoni and Sandro Dias both landed their first 900s within a week of each other. Since then, Alex Perelson landed it at the 2008 Maloof Money Cup, then Mitchie Brusco completed it at X Games 17 during Big Air Practice.\n"
            },
            {
                "id": "aerial-1080",
                "trickName": "1080",
                "trickDescription": "The skater spins 1,080 degrees (3 full rotations) backside or frontside in the air. The trick was long considered to be impossible. However, on March 30, 2012, 12-year-old American, Tom Schaar, landed it on the Woodward California Mega Ramp in five tries.[3] Schaar rode in fakie turned backside and grabbed Mute Air to complete the required three rotations. Riding fakie allowed Schaar to land forward after completing the three rotations. Jono Schwan also accomplished the manoeuvre. Mitchie Brusco later completed the trick at the X-Games in Barcelona in May 2013.[4]\n"
            },
            {
                "id": "aerial-1260",
                "trickName": "1260",
                "trickDescription": "The 1260 (3 and a half full rotations) was landed by Mitchie Brusco at the X-Games Minneapolis 2019.\n"
            },
            {
                "id": "aerial-airwalk",
                "trickName": "Airwalk",
                "trickDescription": "A no-footed Backside Air where the front hand grabs the nose. Usually the front foot is kicked off the toe-side of the board, while the back foot is kicked off the heel-side, producing the impression of walking in the air, hence the name. Rodney Mullen did it on the flat ground first, while Tony Hawk was the first to do it on vert.\n"
            },
            {
                "id": "aerial-backflip",
                "trickName": "Backflip",
                "trickDescription": "The Backflip is an aerial where the rider and his board complete a full rotation on the lateral axis. If the trick is done by launching out of the ramp, the skater lands forwards. If it is done on the wall of a vert ramp, the skater lands backwards, adding significantly to the difficulty and danger involved. It was first done in 1997 by Rob \"Sluggo\" Boyce, because he \"had seen BMX bikers, rollerbladers, and snowboarders do Backflips, and thought it was about time a skateboarder did one.\" He first learned to do it in a gymnasium by launching off a ramp and landing in a foam pit. Once he was comfortable with the technique, he learned to do it on a vert ramp. Despite the trick's appearance in many skateboarding video games, the real trick is still more legendary than commonplace.\n"
            },
            {
                "id": "aerial-frontflip",
                "trickName": "Frontflip",
                "trickDescription": "The Frontflip is a backflip except you flip towards the front foot.\n"
            },
            {
                "id": "aerial-backside-air",
                "trickName": "Backside Air",
                "trickDescription": "A Backside Air is performed by riding up the transition, grabbing the board on the heel side with the front hand, lifting off, turning backside (toward the skater's toes) and landing forward. It is considered a staple of vertical skateboarding. Some skaters grab the board between the trucks, while others grab the nose.\n"
            },
            {
                "id": "aerial-benihana",
                "trickName": "Benihana",
                "trickDescription": "A one-footed tail grab, taking the back foot off and kicking straight down or sideways in a backwards direction. The idea is to take the back foot off and use the front foot to kick the board out ahead of you, and then catch the board by the tail and put it back under your feet. Invented by Lester Kasai and named by Lester and Tony Hawk because at the time they were eating at Benihana restaurants as often as they could.\n"
            },
            {
                "id": "aerial-body-jar",
                "trickName": "Body Jar",
                "trickDescription": "A Backside Air grabbing the nose where the rider smacks the tail of the board on the coping on the way in.\n"
            },
            {
                "id": "aerial-caballerial",
                "trickName": "Caballerial",
                "trickDescription": "A 360 backside ollie from fakie. Invented by Steve Caballero.\n"
            },
            {
                "id": "aerial-candy-flip",
                "trickName": "Candy flip",
                "trickDescription": "A Rodeo combined with a Varial invented by Andy MacDonald.\n"
            },
            {
                "id": "aerial-cannonball",
                "trickName": "Cannonball",
                "trickDescription": "An aerial where the rider grabs the nose with the front hand and the tail with the back hand.\n"
            },
            {
                "id": "aerial-christ-air",
                "trickName": "Christ Air",
                "trickDescription": "A backside air where the board is grabbed on the heel rail with the forward hand, and the body strikes a \"crucifix\"-like pose. Originally invented by Christian Hosoi. Can be performed frontside as well, or even a frontside finger-flip variation as performed by Monty Nolder.\n"
            },
            {
                "id": "aerial-del-mar-indy",
                "trickName": "Del Mar Indy",
                "trickDescription": "A Tuck-Knee Indy where the skater tweaks it back behind his back pointing his knees down. Similar to a Japan Air\n"
            },
            {
                "id": "aerial-frontside-air",
                "trickName": "Frontside Air",
                "trickDescription": "Likely the first aerial to be done on a skateboard, as it is one of the easiest to learn. It involves going up the transition, grabbing the board on the toe side between the feet with the trailing hand, lifting off, and turning frontside (toward the skater's back) and then landing and riding down the ramp. It is a matter of dispute who did the first Frontside Air, but Tony Alva is widely credited with popularizing it. In the first few years of doing this trick, all skaters grabbed the board before lifting off (known as an \"early grab\"). Eventually, it became common practice to Ollie first, then grab the board. However, Ollieing in is much more difficult, and so it is still common to see skateboarders perform the trick early-grab style.\n"
            },
            {
                "id": "aerial-gay-twist",
                "trickName": "Gay Twist",
                "trickDescription": "A Fakie Mute 360. Basically, it is a Caballerial with a Mute Air. It was named a \"Gay Twist\" because Lance Mountain and Neil Blender (who invented it together) couldn't do Caballerials after trying them for a month. So they decided to try to grab them. Because their bodies needed spinning momentum to make the full 360 to land moving forward, they needed to spin their shoulders, which prevented them from grabbing in the stylish, preferred manner, around the knee. The alternative was grabbing the board, with their forward hand on the toe rail of the board, between the legs, or stink bug, which they thought was \"gay.\" Most skaters do consider this trick to be easier. Like the Caballerial, the Gay Twist has spawned numerous variations over the years. Some found it easier to grab backside instead of Mute Air, which they called a \"Les Twist.\" Other notable offspring of the Gay Twist include the Frontside Gay Twist, Kickflip and Heelflip Gay Twists, Varial Gay Twist, and the 720.\n"
            },
            {
                "id": "aerial-helipop",
                "trickName": "Helipop",
                "trickDescription": "This is more of a freestyle or street skating trick than most other aerials. It is essentially the same thing as a Caballerial, but instead of doing a 360 fakie, it is a 360 Nollie with a short pivot on the back wheels before completing the full rotation. This was invented by Rodney Mullen and has been done both backside or frontside.\n"
            },
            {
                "id": "aerial-indy",
                "trickName": "Indy",
                "trickDescription": "The Indy is done by grabbing the toe-side rail with your back hand while doing a backside air. Invented by Duane Peters, who was riding for the Independent Truck Company at the time, hence the name Indy. Note that an Indy Air cannot be performed when turning frontside, it is by nature a backside-turning air. An aerial with the same grab location but turning frontside is known as a frontside air.\n"
            },
            {
                "id": "aerial-japan-air",
                "trickName": "Japan Air",
                "trickDescription": "Essentially a Mute Air where the skater pulls the board up behind his back and knees pointed down for added style.\n"
            },
            {
                "id": "aerial-judo-air",
                "trickName": "Judo Air",
                "trickDescription": "A Backside air where the skater takes his front foot off the board and kicks it forward and pulls the board backwards while the back foot is still on the board. The name of the trick stems from the appearance that the skater is doing a martial-arts-style kick in mid air even though competitive  Judo forbids the use of kicks.\n"
            },
            {
                "id": "aerial-lien-air",
                "trickName": "Lien Air",
                "trickDescription": "Another of the basic airs. It is a frontside air grabbing the nose or heel edge with your front hand (leading hand). Neil Blender was the first to perform this trick, which became known as the Lien Air. Lien is Neil spelled backwards.\n"
            },
            {
                "id": "aerial-madonna",
                "trickName": "Madonna",
                "trickDescription": "A one-footed lien to tail, where the front foot is taken off and kicked out straight down (behind the board), invented by Tony Hawk not long after Madonna's first album was released. Named the Madonna because Tony and his friends were fans of the performer.\n"
            },
            {
                "id": "aerial-mctwist",
                "trickName": "McTwist",
                "trickDescription": "The McTwist is an aerial where the rider performs an inverted backside 540 while grabbing Mute Air on the toe rail, with the forward hand, around the knee. Other 540 aerials came later, and they are generally known by the style of grab nad the rotation, as in \"backside 540\" or abbrivated to \"Indy 5.\" Invented by Mike McGill, who first performed it on a wooden half-pipe in Sweden in 1984.[5]\n"
            },
            {
                "id": "aerial-melancholymelon",
                "trickName": "Melancholy/Melon",
                "trickDescription": "A Backside Air where the skater grabs the board on the heel edge between the feet with their front hand and tweaks the board as forward as possible for added style.\n"
            },
            {
                "id": "aerial-method-air",
                "trickName": "Method Air",
                "trickDescription": "Another Backside Air variation where the skater straightens his hips and bends his knees so that the board goes up behind his back. Invented by Neil Blender and originally called a Methodist Air, the name was shortened not long after the original photo ran in Transworld Skateboarding in 1984.\n"
            },
            {
                "id": "aerial-mute-air",
                "trickName": "Mute Air",
                "trickDescription": "Performed by riding up the transition and grabbing with the front hand on the toe side of the board around the front leg and between the feet, turning backside, and landing. It is the same grab as a slob air, but turning the opposite direction. The Mute Air was invented by deaf skateboarder Chris Weddle around 1981, and was named by other skateboarders who referred to him as the \"quiet, mute guy.\" After having a conversation with Weddle about the trick's origins, Tony Hawk announced on August 12, 2020 that in Tony Hawk's Pro Skater 1 + 2 the trick would be renamed the Weddle Grab to better honor Weddle's legacy, as Weddle is hearing impaired but not lacking speech.[6]\n"
            },
            {
                "id": "aerial-no-comply",
                "trickName": "No Comply",
                "trickDescription": "The No Comply is an alternate method of getting air. The rider pops the tail of the board, planting the front foot in the ground simultaneously. They then launch off their 'planted' foot while catching the board with the inside of the back leg, getting the front foot back on board for landing. There are many variations include the Frontside Pop Shove-It No Comply, the No Comply up a curb, the No Comply 360, etc.  All can be done by altering the backfoot position and how much pop and spin you put on your board.\n"
            },
            {
                "id": "aerial-nosegrab",
                "trickName": "Nosegrab",
                "trickDescription": "The Nosegrab is similar to the Tailgrab, however, instead of grabbing the tail (back) of the board, you grab the nose (front). The rider ollies, pops back foot off board and grabs the nose (front) of the skateboard. Once the rider lets go, the rider must set his/her back foot back down over the back bolts and his/her front foot over the front bolts.\n"
            },
            {
                "id": "aerial-roastbeef",
                "trickName": "Roastbeef",
                "trickDescription": "Performed similar to a Stalefish, however the skater grabs the heel-edge of the board with his or her trailing hand in-between the legs, rather than wrapping the arm behind. Named and popularized by Jeff Grosso, it is much simpler to execute than a Stalefish, and is sometimes referred to as the \"poor-man's stalefish.\"\n"
            },
            {
                "id": "aerial-rocket-air",
                "trickName": "Rocket Air",
                "trickDescription": "An air where the skateboarder grabs the nose of the skateboard with both hands and at the same time places both feet on the tail, turning sideways momentarily before returning to regular stance and landing. Invented by Christian Hosoi.\n"
            },
            {
                "id": "aerial-sack-tap",
                "trickName": "Sack tap",
                "trickDescription": "A sack tap is when the skater flies into the air off a ramp, grabs his board in mid-air with both hands and taps his testicles then puts the board back under his feet and lands on the ground. Invented by Tony Hawk.\n"
            },
            {
                "id": "aerial-saran-wrap",
                "trickName": "Saran Wrap",
                "trickDescription": "Taken from a freestyle trick invented by Rodney Mullen, this air is performed by grabbing backside with the front hand and then kicking or \"wrapping\" the front leg forward then in a circular motion around the nose of the board.  Once the leg has wrapped at least 180 around the board, the back hand grabs like a frontside air while the back hand is released and the front foot is placed back on the board.\n"
            },
            {
                "id": "aerial-sean-penn",
                "trickName": "Sean Penn",
                "trickDescription": "The Sean Penn is similar to a Madonna except the skateboarder turns backside instead of frontside, usually kicking the front foot up and off the toe side of the board  before hitting the tail on the coping. It was named because Sean Penn was married to Madonna at the time it was invented, and thus was the opposite of a Madonna.  Possibly invented by Mark Rogowski, who popularized the trick.\n"
            },
            {
                "id": "aerial-slob-air",
                "trickName": "Slob-Air",
                "trickDescription": "Performed by riding up the transition grabbing with your leading hand on the toe side of the board between the feet, launching off the coping turning frontside, and landing. The Layback air—which has a similar \"grab\"— preceded the slob-air by a number of years. While Slob-Airs, Slob-Bonelesses and Fastplants, Slob-Airs were common in the 1980s and are still staples of transition skateboarding, nearer to the present, Tony Hawk made a Heelflip Slob Air and Lincoln Ueda landed a Slob 540.\n"
            },
            {
                "id": "aerial-stalefish",
                "trickName": "Stalefish",
                "trickDescription": "One of the more difficult aerial variations. A Stalefish is a heel-side grab with your back hand reaching around your back leg, meaning it is not only awkward to reach, but necessitates that you grab quite late in your air. As for the name, it came from a camper at a Swedish skate camp where Tony Hawk was practicing. One day Tony landed the first Stalefish but didn't have a name for it yet. During dinner, the only thing they had to eat at the camp was canned fish. The dinner apparently was not too appetizing to Tony, who called it \"stale fish.\" The camper he was with misunderstood and assumed he was naming his new trick, and it stuck.\n"
            },
            {
                "id": "aerial-tailgrab",
                "trickName": "Tailgrab",
                "trickDescription": "The skater pops either side of the board, reaches behind, and grabs the tail with his/her hand. Generally considered one of the hardest of the basic aerials to do, since grabbing the tail adds little stability and tends to want to make the front foot come off the board.\n"
            },
            {
                "id": "aerial-varial",
                "trickName": "Varial",
                "trickDescription": "Originally a Varial was a Frontside Air where the skater reached between the legs and grabbed the board on the heel edge with the back hand (now known as a Roastbeef grab), then turned the board 180 degrees frontside with the hand before putting it back on the feet and landing. Like all Frontside Airs at the time, they were performed without an Ollie (early-grab). This version, however, is not very common anymore. Tony Hawk invented the Backside Varial in 1980, adding an Ollie in the process. Before long, 360 Varials, where the skater turns the board 360 degrees backside and grabs it, became commonplace. After the invention of the Kickflip Indy, most professional vert skaters had to be able to perform one to win a contest, and soon they were looking for ways to increase the difficulty. One of the ways was to spin the board 180 degrees during the Kickflip, which ended up being called a Varial Kickflip Indy. Somehow the term filtered back into street skating and it became common for a Kickflip combined with a Pop Shove it (180 spin of the board) to be called a Varial Kickflip. Some have even gone so far as to drop the \"kickflip\" from the name altogether, calling a Kickflip Shove-it a \"Varial.\" However, vertical skateboarders still use the term Varial to describe any trick involving spinning the board and grabbing it.\n"
            },
            {
                "id": "aerial-wall-ride",
                "trickName": "Wall-Ride",
                "trickDescription": "A trick where a rider transitions onto a vertical wall and continues to travel along it with all four wheels touching the wall until then transitioning to the flat ground, a bank or a curved ramp. A wall-ride can be combined with other tricks such as the kickflip, both in and out and doing so adds a significant increase in the difficulty level.\n"
            }
        ]
    },
    {
        "categoryId": "slide",
        "category": "Slide",
        "tricks": [
            {
                "id": "slide-anti-casper-slide",
                "trickName": "Anti-Casper Slide",
                "trickDescription": "Performed by flipping the board into a nosecasper via half impossible and sliding on the nose in a nose casper position."
            },
            {
                "id": "slide-bananaslide",
                "trickName": "Bananaslide",
                "trickDescription": "A combination of a tailslide and a nose slide between two obstacles at the same time. Rarely seen as not many obstacles allow you to do this trick"
            },
            {
                "id": "slide-bertslide",
                "trickName": "Bertslide",
                "trickDescription": "A four-wheeled slide where the skateboarder puts one hand on the ground and rotates the board while it is still on the ground, effectively sliding on the wheels of the skateboard.[1] The trick was named after the surfer Larry Bertlemann, who performed the trick in his surfing routine.[2] It was then popularized by the Z-Boys, who adapted the move by extending the slide to 360 or even 540 degrees.[2]"
            },
            {
                "id": "slide-bluntslide",
                "trickName": "Bluntslide",
                "trickDescription": "Performed by ollieing over/onto the obstacle and fitting the edge/rail between the tail and back truck of one's skateboard and sliding. Can be performed on flat ground (called a bluntstop)[3] or downhill, possibly with only the tip of the board sliding on the street and all four wheels lifted."
            },
            {
                "id": "slide-boardslide-aka-railslide",
                "trickName": "Boardslide, aka railslide",
                "trickDescription": "The board straddles the obstacle perpendicularly as the skateboarder slides along the center of the board. Most commonly when people refer to boardslides, it is a backside boardslide unless stated otherwise. The basic board slide also goes by many names, like: \"back board,\" \"bs board,\" \"b-slide,\" and heavily depends on your vernacular."
            },
            {
                "id": "slide-casperslide",
                "trickName": "Casperslide",
                "trickDescription": "A casperslide is performed by flipping the board into an up-side down state with one foot on the bottom (now top) of the tail and the front foot underneath the front truck (griptape side) and sustaining momentum, thus sliding on the tip of the board's concave. It  can be performed on rails (rarely done) or flat ground. Often Attributed to Rodney Mullen."
            },
            {
                "id": "slide-cess-slide",
                "trickName": "Cess Slide",
                "trickDescription": "This is a four-wheeled slide performed on inclines, banks, ditches, and transition. most common riding frontside or straight up the transition. At the peak of momentum, the rider unweights the board and slides the back wheels up to 'catch up' with the rest of the body at 90 degrees. Then as  the body's momentum returns, the rider pivots the back truck while sliding the front wheels 90 degrees back toward the bottom of the incline.  Simply put, backside shred up, pivot back down. A fun lazy way of riding transition backside. if you ride up frontside, you do this trick in a backside 'alley-oop' fashion. This is also very common in backyard pool riding, due to the benefits of 'feeling' your way around the cement."
            },
            {
                "id": "slide-coleman-slide",
                "trickName": "Coleman Slide",
                "trickDescription": "This is where a rider wearing sliding gloves performs a frontside slide using their downhill hand with the glove to break the wheels free of traction while swinging the uphill hand close to the body to revert the board back from the initial slide in a pendulum motion. Named after slalom champion and sliding godfather Cliff Coleman, it is regarded as a staple trick in downhill sliding because it allows riders to see what is coming at them (objects, cars, hazards) all while in control, as well as allow them to slow down. A Coleman slide can also be used to initiate a frontside spin if the rider ends the slide at 180 degrees instead of swinging back to the original stance with a pendulum. If the rider flows into a backside slide with one smooth motion, it is possible to do 360 spins and more."
            },
            {
                "id": "slide-crail-slide",
                "trickName": "Crail Slide",
                "trickDescription": "This is a tailslide where the skater grabs the nose of the board with the back hand while sliding. Usually performed on a ramp. It comes from the same idea as the more popular Lien Slide, in that in both tricks the skater grabs the board to help put it in position for the tailslide. Since the invention of the Ollie, it is more common to Ollie into a tailslide."
            },
            {
                "id": "slide-darkslide",
                "trickName": "Darkslide",
                "trickDescription": "The Dark slide is a seemingly complicated looking trick in which the rider approaches a ledge or rail and does a flip trick onto the obstacle so that the rider lands on the board upside down with their feet on the nose and the tail and slides across the obstacle. Generally a half-kickflip or half-heelflip is the flip trick used to get into a darkslide. Created by Mark Gonzales in 1991.[4]"
            },
            {
                "id": "slide-flat-spin",
                "trickName": "Flat spin",
                "trickDescription": "A hands-down rotation in the Surrender position. The slide can either be initiated by diving forward into a surrender slide and slinging the board around with your legs, or by doing a frontside or backside 360 and continuing the spin in a surrender position. Skilled riders can rotate as much as 1440 degrees or even more (there is no official record). Once the technique is perfected it allows you to rotate fast and slide very far while losing very little momentum due to the rider's weight being on his gloves when his board is sliding and on his board when it is pointing downhill and rolling."
            },
            {
                "id": "slide-layback",
                "trickName": "Layback",
                "trickDescription": "Also known as a Sergio slide (named after the Brazilian inventor of the move, Sergio Yuppie), a layback is a frontside slide performed while riding downhill by placing your uphill hand on the ground behind the tail of your board and breaking the rear wheels out of traction. From here you can rotate 180 degrees, swing a pendulum, or hold the slide at 90 degrees and thrust your pelvis upward to unweight the board, resulting in a longer slide. The last variation is considered to be the most challenging and stylish, but often results in flat spots on your wheels. Like all hands-down slides, this trick requires slide gloves to be executed at speed."
            },
            {
                "id": "slide-lipslide",
                "trickName": "Lipslide",
                "trickDescription": "Similar to a boardslide only the skater turns 90 degrees so that the trailing trucks are placed over the rail/ledge/coping and the skater slides on the middle of the board. Considered more complex than a boardslide due to the rotation over the obstacle at the beginning into the trick and the re-entry or dismount. Note that in this case a frontside lipslide involves facing forwards while a backside lipslide involves facing backwards. Also known as a Disaster slide."
            },
            {
                "id": "slide-noseblunt",
                "trickName": "Noseblunt",
                "trickDescription": "Same as a blunt slide, only performed with the nose and the front wheels. 90-degree ollie over the object to be sliding, locking the nose into a slide position. Wheels drag across the ledge/platform like a power slide while the nose slides along the lip.  on a rail, the rider 'ollies over' into a nose slide position. The term noseblunt, in downhill or flatground riding, refers to a powerslide happening on only the front two wheels."
            },
            {
                "id": "slide-nose-grab-tail-drag",
                "trickName": "Nose grab tail drag",
                "trickDescription": "The skater pops the board into his hand, grabs the nose, and pulls up so that the wheels come off the ground and only the tail is sliding."
            },
            {
                "id": "slide-noseslide",
                "trickName": "Noseslide",
                "trickDescription": "A noseslide is performed by riding parallel to an obstacle (ledge, rail, etc...) The skateboarder then does an ollie and turns the board 90 degrees. They then land on the ledge with the nose of the board sliding on top of it. This can be done frontside or backside. The skateboarder can then come off the ledge either regular or fakie (backwards)."
            },
            {
                "id": "slide-nosetail-5-0-slides",
                "trickName": "Nose/Tail 5-0 Slides",
                "trickDescription": "A 5-0 Slide can be done frontside or backside, with either the front two or the rear two wheels sliding on the ground while the rider is sliding standing up or with his hands on the pavement. If the nose or tail of the board slides on the ground it is considered a bluntslide."
            },
            {
                "id": "slide-pendy-(pendulum)-slide",
                "trickName": "Pendy (Pendulum) Slide",
                "trickDescription": "This is a backside slide where the rider puts both hands on the street in front of their toes and extends their body out into a push-up position (you can also keep your knees bent in order to spin around faster), either returning to the original stance with a pendulum or rotating a full 180 degrees. A more difficult variation is to put only your uphill hand on the pavement and slide with your shoulders perpendicular to the ground. Toeside 360s can be done by continuing immediately into a frontside slide after the first 180 degrees."
            },
            {
                "id": "slide-powerslide",
                "trickName": "Powerslide",
                "trickDescription": "The powerslide is a four wheel slide usually performed to stop the skateboard. It is performed by gaining speed, and turning the board 90 degrees while leaning the body back. The hands do not touch the ground when performing a powerslide. The skater can also turn the board more than 90 degrees resulting in the board continuing to roll and a very stylish maneuver. If the rider is going fast enough downhill it is possible to do powerslide rotations. Can also be done leaning forward but must be rotated the opposite way,  which makes it similar to a bert slide but without placing the hand on the ground."
            },
            {
                "id": "slide-primoslide",
                "trickName": "Primoslide",
                "trickDescription": "The primoslide is a trick in which the rider flips the board and lands on it wheels and the side of the deck. It's mostly done on big boxes or on flat."
            },
            {
                "id": "slide-push-up",
                "trickName": "Push up",
                "trickDescription": "Putting both hands on the ground, leaning on the toeside edge, and spinning clockwise on the ground."
            },
            {
                "id": "slide-stink-bug",
                "trickName": "Stink bug",
                "trickDescription": "Leaning back on the board, putting one hand behind you on the ground while gripping the board between your legs. This is considered \"bad form\" in the downhill community."
            },
            {
                "id": "slide-surrender-slide",
                "trickName": "Surrender Slide",
                "trickDescription": "Another downhill slide requiring slide gloves, a surrender slide is when a rider places both hands on the street in front of their board and lowers their upper body close to the pavement, extending their legs behind them and gripping the board with the sides of their feet. While not a particularly difficult or impressive slide, it is useful for linking together various other downhill slides. The wheels do not necessarily slide in a surrender because the deck remains pointing downhill, although it is possible to drift in this position."
            },
            {
                "id": "slide-tailslide",
                "trickName": "Tailslide",
                "trickDescription": "Similar to the noseslide only when turning 90 degrees the tail of the board is landed on the edge of the ledge/rail."
            }
        ]
    },
    {
        "categoryId": "ollie",
        "category": "Ollie",
        "tricks": [
            {
                "id": "ollie-switch-ollie",
                "trickName": "Switch Ollie",
                "trickDescription": "an Ollie performed in the stance opposite of a rider's normal stance. (Switch Stance)."
            },
            {
                "id": "ollie-nollie",
                "trickName": "Nollie",
                "trickDescription": "an Ollie performed using the front foot to snap the nose down."
            },
            {
                "id": "ollie-fakie-ollie",
                "trickName": "Fakie Ollie",
                "trickDescription": "an ollie done while riding backwards"
            },
            {
                "id": "ollie-the-chinese-ollie",
                "trickName": "The Chinese Ollie",
                "trickDescription": "executed without hitting the tail of the skateboard to the ground, instead the skateboarder uses cracks in the sidewalk, by \"bouncing\" off them, to get air-time."
            },
            {
                "id": "ollie-ollie-180",
                "trickName": "Ollie 180",
                "trickDescription": "an Ollie where the skateboarder and the skateboard spins 180 degrees after leaving the ground. Both the skateboarder and the skateboard rotate in the same direction (Frontside or Backside) with the skateboarder's feet sticking to the skateboard. This trick is usually referred to as a frontside or backside 180, or less frequently and more popular with older skateboarders and/or when performed on a bank/quarterpipe, a frontside / backside ollie"
            },
            {
                "id": "ollie-nollie-180",
                "trickName": "Nollie 180",
                "trickDescription": "just like the Ollie 180 but done from a Nollie."
            },
            {
                "id": "ollie-half-cab",
                "trickName": "Half-Cab",
                "trickDescription": "just like the Ollie 180 but done in fakie. If rotated 360 degrees the trick is called a Full-Cab or Caballerial, named after Steve Caballero who invented them as aerials in pools. Cab and half-cab spins only include fakie backside. A fakie frontside 180 is not a half-cab."
            },
            {
                "id": "ollie-switch-ollie-180",
                "trickName": "Switch Ollie 180",
                "trickDescription": "just like the Ollie 180 but done from a Switch Ollie."
            },
            {
                "id": "ollie-ollie-360",
                "trickName": "Ollie 360",
                "trickDescription": "is a full 360 rotation of the body and board together in one motion, whether front-side or back-side can be attained from this variation."
            },
            {
                "id": "ollie-one-foot",
                "trickName": "One Foot",
                "trickDescription": "an Ollie where the front foot is kicked forward over the nose of the board."
            },
            {
                "id": "ollie-ollie-north",
                "trickName": "Ollie North",
                "trickDescription": "the original name for the one foot"
            },
            {
                "id": "ollie-boned-ollie",
                "trickName": "Boned Ollie",
                "trickDescription": "an ollie where the board is dipped down and the legs are practically horizontal, like a \"Melon Grab\" but without the skateboarder actually grabbing the skateboard."
            },
            {
                "id": "ollie-ghost-ollie",
                "trickName": "Ghost Ollie",
                "trickDescription": "an ollie where the skateboarder's feet are above the board but the board and the skateboarder are still in air."
            },
            {
                "id": "ollie-pop-shuvit",
                "trickName": "Pop-Shuvit",
                "trickDescription": "is an Ollie variation with the snap of the tail rotating the board 180 or 360 beneath the rider and catching it in mid-air. A Pressure-flip has a similar aspect from this trick, but only by applying pressure back-toe inward while jumping, will the rider make a rotation and inward flip successful."
            },
            {
                "id": "ollie-primo-ollie",
                "trickName": "Primo Ollie",
                "trickDescription": "is an Ollie performed when standing in a primo position or when doing a primo slide. A primo Ollie is executed in the same way as an Ollie but the side of the front foot levels out the board instead of the top of the foot."
            },
            {
                "id": "ollie-hop-ollie",
                "trickName": "Hop Ollie",
                "trickDescription": "an Ollie using only one foot, such as a \"Hop Nollie\" [9] (not the same as a no-comply)"
            }
        ]
    },
    {
        "categoryId": "grind",
        "category": "Grind",
        "tricks": [
            {
                "id": "grind-5-0-grind",
                "trickName": "5-0 grind",
                "trickDescription": "Pronounced \"Five-Oh\". In this maneuver, the back truck grinds the rail/edge, while the front truck is suspended directly above the rail/edge. This move is similar to the manual, although the tail may be scraped against the obstacle as well as the back truck, which is not considered proper on a manual."
            },
            {
                "id": "grind-nosegrind",
                "trickName": "Nosegrind",
                "trickDescription": "For a Nosegrind, the front truck grinds the obstacle, while the back truck is suspended over the rail/edge. It is similar to the nose manual, except performed on a rail, coping, or ledge. This move originated on vert, initially in the form of Neil Blender's New Deal (nose pivot to disaster), then by his more advanced progression of said move, the \"Newer Deal\", which left out the disaster part and just pivoted all the way back in."
            },
            {
                "id": "grind-crooked-grind",
                "trickName": "Crooked grind",
                "trickDescription": "Also known as Crooks, Crux, Pointer Grind, or the K-grind after the man to whom the trick is most commonly accredited, Eric Koston. It is like a nosegrind, but the tail of the board is angled away from the rail/ledge on which the trick is performed, causing the edge of the deck's nose to also rub. Due to the lack of historical evidence there is no way to prove when this trick was first landed, nevertheless, both Eric Koston and Dan Peterka were the first two skaters documented purposely performing this trick in their respective H-Street's Next Generation video parts. As a result, both skateboarders are regarded as co-creators of this trick.[4]"
            },
            {
                "id": "grind-overcrook-grind",
                "trickName": "Overcrook grind",
                "trickDescription": "Also known as Overcrooks, or Overcrux, is similar to the Crooked grind, but with the tail of the board being angled towards the far side of the rail/box."
            },
            {
                "id": "grind-feeble-grind",
                "trickName": "Feeble grind",
                "trickDescription": "In this move, the back truck grinds a rail while the front truck hangs over the rail's far side. Professional skateboarer Josh Nelson is the inventor of this grind back in 1986 at the Del Mar skate ranch in Del Mar, California. The name feeble grind came from Josh Nelson's friend and fellow skateboarder Sean Donnelley. Sean used to call Josh \"the feeb\" which was short for feeble, because Nelson was so skinny and often had broken limbs and injuries from skateboarding. Many people watched Josh create this unique type of grind on the parking blocks that were mounted in the reservoir at the Del Mar Skate Ranch."
            },
            {
                "id": "grind-smith-grind",
                "trickName": "Smith grind",
                "trickDescription": "This maneuver entails the back truck grinding an edge or rail, while the front truck hangs over the near side of the object, leaving the edge of the deck to rub the lip/edge. This trick was named after its inventor Mike Smith (skateboarder). It is considered by many to be the most difficult basic grind trick. The backside version known as a Monty Grind was originated by  Florida powerhouse Monty Nolder."
            },
            {
                "id": "grind-willy-grind",
                "trickName": "Willy grind",
                "trickDescription": "Popularized by Willy Santos. Very rarely executed, the Willy is done with the front truck sliding on the grinding surface (as in a nose grind) while the back truck hangs down below the surface on the side to which the skateboarder approached. Also called \"Lazy Grind\", \"Nosesmith\", or \"Scum Grind.\""
            },
            {
                "id": "grind-losi-grind",
                "trickName": "Losi grind",
                "trickDescription": "Popularized by Allen Losi. Can be best described as an Overcrook with the tail hanging below a rail or with wheels sliding along on a ledge or as a Willy with the tail on the other side of the obstacle. Also called \"Nosefeeble,\" \"Over Willy Grind\" or \"Over-Scum,\" or \"Bag-Lady Grind.\""
            },
            {
                "id": "grind-suski-grind",
                "trickName": "Suski grind",
                "trickDescription": "Popularized by Aaron Suski. Very similar to the 5-0 but the front truck is turned outward like a smith grind. The difference between a Smith and a Suski is that the tail is pressed downward and the front truck is raised up instead of being dipped low. Simply a raised or \"blunted\" smith grind."
            },
            {
                "id": "grind-salad-grind",
                "trickName": "Salad grind",
                "trickDescription": "Like the Suski, but the front truck is turned inward like a feeble grind. The back truck is locked on the rail, the tail is pressed downward, and the front truck is raised up instead of being dipped low. Simply a raised or \"blunted\" feeble grind."
            },
            {
                "id": "grind-hurricane-grind",
                "trickName": "Hurricane grind",
                "trickDescription": "The \"cane\" variations involve turning 180 to land in some sort of smith/feeble variation. Generally the \"cane\" variations should finish by turning back the way they came, so that the rider will land in the same stance from which he started(unless stated otherwise- ie. \"hurricane to fakie\".) The Hurricane is a 180 into a fakie feeble grind, and a 180 back out, landing in the original stance. It is a similar motion to a boardslide, but over-rotated so that the back truck locks on the obstacle. This trick was invented on vert by Neil Blender in 1985; an early proto-version can by witnessed in Powell Peralta's second video, Future Primitive, during Blender's brief cameo appearance on Lance Mountain's backyard ramp."
            },
            {
                "id": "grind-sugarcane-grind",
                "trickName": "Sugarcane grind",
                "trickDescription": "The Sugarcane is an alley-oop 180 into a fakie smith grind, and a 180 back out, landing in the original stance. It is a similar motion to a lipslide (where the back truck must pass over the obstacle), but over-rotated so that the back truck locks on the obstacle."
            },
            {
                "id": "grind-novacane-grind",
                "trickName": "Novacane grind",
                "trickDescription": "The Novacane is an alley-oop 180 into a switch feeble grind, with a 180 back out, landing in the original stance. It's a similar motion to the Sugarcane, but instead of landing the back truck on the obstacle in fakie smith, the front truck locks on in switch feeble."
            },
            {
                "id": "grind-bennett-grind",
                "trickName": "Bennett grind",
                "trickDescription": "Popularized by Matt Bennett. For a Bennett grind the rider must approach frontside and do a backside 180 into a switch backside smith grind. This trick name is exclusively for the version of the trick where the rider approaches frontside."
            },
            {
                "id": "grind-barley-grind",
                "trickName": "Barley grind",
                "trickDescription": "The opposite of a Bennett. The rider approaches backside and does a frontside 180 into a switch frontside smith grind. This trick name is exclusively for the version of the trick where the rider approaches backside."
            },
            {
                "id": "grind-caveman-grinds",
                "trickName": "Caveman grinds",
                "trickDescription": "A caveman grind is when a skater, instead of ollieing up onto a rail, starts with the board in his hand, places it onto the rail in the desired grind position and at the same time jumps onto the board, starting the grind."
            },
            {
                "id": "grind-5-0-hand-drag",
                "trickName": "5-0 hand drag",
                "trickDescription": "This trick is a 5-0 and while doing one, you drag your back hand on the rail/ledge."
            },
            {
                "id": "grind-tractor-grind",
                "trickName": "Tractor grind",
                "trickDescription": "5-0 Hand Drag with the front hand"
            },
            {
                "id": "grind-nosegrind-hand-drag",
                "trickName": "Nosegrind hand drag",
                "trickDescription": "This trick is a nosegrind while you drag your back hand on the rail/ledge."
            },
            {
                "id": "grind-layback-grind",
                "trickName": "Layback grind",
                "trickDescription": "This is a classic variation of the basic frontside or backside grind whereupon the skater leans back (\"lays back\") and places their trailing hand on or near the lip being ground, ostensibly to help \"push\" the grind further. Original Bones Brigade member Jay Smith did the earliest and most popular frontside examples, slashing out violently at the lip with his board while placing his hand well down the transition, in a very \"surf-style\" pose. By 1979 the move was being taken up on top of the lip (both truck and hand) by Duane Peters, the distinction being noted by the adjustment of the name to \"layback roll-out\", or, occasionally, \"layback grind-to-tail\". The backside version was introduced by Eddie \"El Gato\" Elguera later that same year."
            },
            {
                "id": "grind-wax-the-rail",
                "trickName": "Wax the rail",
                "trickDescription": "When you do a Nosegrind Hand Drag with the front hand. Invented by Brandon Tumber of Slaughterhouse fame."
            },
            {
                "id": "grind-primo-slidesgrinds",
                "trickName": "Primo slides/grinds",
                "trickDescription": "When in rail stance and slide on the ledge slash rail. Primo grind in when you grind on both wheels/bearings in rail stance."
            },
            {
                "id": "grind-body-varial-grinds",
                "trickName": "Body varial grinds",
                "trickDescription": "When you turn your body 180 while the board slides. Almost always done on grind that doesn't require pressure with feet."
            },
            {
                "id": "grind-5-0-overturn",
                "trickName": "5-0 overturn",
                "trickDescription": "When the rider does a 5-0 and turns 180 while grinding to turn the trick into a nosegrind."
            },
            {
                "id": "grind-nosegrind-overturn",
                "trickName": "Nosegrind overturn",
                "trickDescription": "Also called Nosegrind to Pivot. When the rider is grinding on the front truck and turns 180 while grinding, making it into a 5-0."
            },
            {
                "id": "grind-crail-grind",
                "trickName": "Crail grind",
                "trickDescription": "5-0 Back hand nosegrab"
            },
            {
                "id": "grind-seatbelt-grind",
                "trickName": "Seatbelt grind",
                "trickDescription": "Nosegrind front hand tailgrab."
            },
            {
                "id": "grind-coffin-50-50",
                "trickName": "Coffin 50-50",
                "trickDescription": "While lying on the board on your back whilst you're doing a 50-50 grind. Invented by Mark Nicolson (Death Skateboards, Squadrophenia 2004)."
            },
            {
                "id": "grind-tailblock-grind",
                "trickName": "Tailblock grind",
                "trickDescription": "Tailslide nosegrab"
            },
            {
                "id": "grind-noseblock-grind",
                "trickName": "Noseblock grind",
                "trickDescription": "Nosegrind tailgrab"
            },
            {
                "id": "grind-hang-ten-nosegrind",
                "trickName": "Hang-ten nosegrind",
                "trickDescription": "Nosegrind when both of your feet are on the nose with your toes pointing forward."
            },
            {
                "id": "grind-hang-five-nosegrind",
                "trickName": "Hang-five nosegrind",
                "trickDescription": "A one footed nose grind with your toe pointing forward."
            },
            {
                "id": "grind-handstand-grinds",
                "trickName": "Handstand grinds",
                "trickDescription": "Require a long rail. Jump into a grind, then do a handstand on the board while grinding."
            }
        ]
    },
    {
        "categoryId": "freestyle",
        "category": "Freestyle",
        "tricks": [
            {
                "id": "freestyle-5050-truckstandprimo",
                "trickName": "50/50 Truckstand/primo",
                "trickDescription": "A 50/50 truckstand is when the board is balanced nearly vertical with the back foot standing on the truck and the front hand holding the nose. The typical way to perform a 50/50 truckstand is to put the board into nosestop, grasp the board with the back hand, jump and toss it to the front hand and land with the back foot on the truck, then execute a half-finger flip to land it.\n"
            },
            {
                "id": "freestyle-casper",
                "trickName": "Casper",
                "trickDescription": "A freestyle stance where the skateboard is upside down and balanced on the point of the tail. The skater's back foot is on the underside of the tail and the front foot is hooked under the deck (touching the front foot to the ground is not a proper Casper). Named for inventor Bobby \"Casper\" Boyden.\n"
            },
            {
                "id": "freestyle-railstand",
                "trickName": "Railstand",
                "trickDescription": "In a Railstand, the skateboard is balanced on one edge with the rider standing on the opposite edge, usually with the feet also on the wheels. This position can be used as a set-up for many other tricks, and was invented in the 1970s by Bobby \"Casper\" Boyden.\n"
            },
            {
                "id": "freestyle-360-spin",
                "trickName": "360 Spin",
                "trickDescription": "1970s skate competitions such as the ones shown in Lords of Dogtown would often have an event to see who could do the most consecutive 360 spins on a skateboard. Variations include one-foot spins (on the nose or tail, or grabbing the foot while spinning), two-foot spins (on the nose or tail), crossfoot spins, two-board spins, etc.\n"
            },
            {
                "id": "freestyle-bigspin",
                "trickName": "Bigspin",
                "trickDescription": "A trick in which the board rotates 360-degrees while the skateboarder turns 180 degrees in the same direction above it. If the skateboarder rotates in the opposite direction of the skateboard it is called Anti-Bigspin. This can be done in any direction from any position, and in freestyle is often done following a Casper.\n"
            },
            {
                "id": "freestyle-gazelle",
                "trickName": "Gazelle",
                "trickDescription": "A Gazelle is a 540-degree rotation of the board while the rider spins 360 degrees in the same direction above it. It is usually done off the front end of the board and spun backside while travelling forwards, but can be done in any direction and combined with flips. Effectively, this is the next step up from a Bigspin.\n"
            },
            {
                "id": "freestyle-shove-it",
                "trickName": "Shove-it",
                "trickDescription": "A Shove-it is a 180-degree spin (instead of a flip) of the board. The name may have qualifiers added to describe the direction of spin (frontside or backside) or a higher amount of spin. In freestyle, the trick is usually performed off the front of the board while riding forwards, which helps ensure flat and fast spins. In streetstyle, Shove-Its are often popped (called a Pop Shuvit) from either end of the board. Frontside or backside rotations are possible. A Shove-it should spin totally flat, in contrast to an Impossible which should spin totally vertical.\n"
            },
            {
                "id": "freestyle-walk-the-dog",
                "trickName": "Walk The Dog",
                "trickDescription": "A footwork trick which spins the board.  The front foot is positioned in the middle of the board while the back foot steps to the nose and brings it backwards, spinning the board 180 degrees. With practice, this trick can be done in quick repetition – or backwards – though a slow performance can create an illusion of speed.\n"
            },
            {
                "id": "freestyle-end-over",
                "trickName": "End-Over",
                "trickDescription": "An End-Over is a series of 180-degree pivots, beginning on the nose (or the tail when rolling fakie). Pressure is placed on the nose to lift the back wheels, then the rider quickly turns 180 degrees (frontside or backside), pivoting on the nose while maintaining speed and direction of travel. One pilot is immediately followed by another in the opposite rotation; when these pivots are done in consecutive lines, they are considered End-Overs (end-over-end). It is not uncommon to mix more difficult pivots in to a sequence of End-Overs, such as a 360 pivot or one-foot pivot.\n"
            },
            {
                "id": "freestyle-butter-flip",
                "trickName": "Butter Flip",
                "trickDescription": "The Butter Flip is executed following a Heelside Railstand. Both feet hop to one side of the board, side by side with no more than a 2-inch (5 cm) gap. The rider puts pressure onto the end of the board, using the foot that is not on the wheel. This pops the board up, allowing it to be grasped with the hand opposite the foot which applied pressure. This trick is used to transition from Heelside Railstand to a Pogo or 50/50. The board can also be caught with the foot, making it a Butter Flip to a No Handed 50/50. The trick is named for its inventor, Keith Butterfield.\n"
            },
            {
                "id": "freestyle-fingerflip",
                "trickName": "Fingerflip",
                "trickDescription": "A Fingerflip uses a flick of the fingers to flip the skateboard. Typically, the rider rolls forward, grabs the nose of the board with the front hand, then simultaneously jumps and flips the unweighted board with their hand. The rider will then come down on the board or catch the board in mid-air. There are numerous variations including the Double Fingerflip, Varial Fingerflip, Backhand Fingerflip, and 360 Fingerflip, and Fakie versions of these. Ollie Fingerflip variations are considered to be more difficult because the rider must Ollie before initiating the Fingerflip. Professional freestyler Darryl Grogan is known for his Ollie 360 Fingerflip, and Rodney Mullen is known to use an Ollie Varial Fingerflip in many of his runs and videos.\n"
            },
            {
                "id": "freestyle-kickflip",
                "trickName": "Kickflip",
                "trickDescription": "This trick begins with the rider positioned with feet side-by-side pointed toward the nose; one foot (typically the back foot) is hooked around the edge of the board. The opposite foot pushes down and the hooked foot kicks sideways as the rider jumps, the rider's body turning to land in a normal riding position. Invented by Curt Lindgren. \n"
            },
            {
                "id": "freestyle-kickback",
                "trickName": "Kickback",
                "trickDescription": "A trick involving a half flip backwards followed by one-and-a-half flips forwards. From a stance with the front foot on the front bolts and the toes of the back foot along the heelside edge in the middle of the board, it can be accomplished by pushing down on the toes of the back foot, then jumping, kicking the board forwards, and catching it on the grip tape.\n"
            },
            {
                "id": "freestyle-ollie",
                "trickName": "Ollie",
                "trickDescription": "The Ollie is a trick in which the rider and board leap into the air without use of the rider's hands. The rider stomps on the tail of the board to bring it mostly vertical, jumps, bends the knees as the skateboard springs up, and slides the front foot forward to level the skateboard at the peak of the jump. It was originally developed by Alan \"Ollie\" Gelfand in a bowl, and bought to flat ground by Rodney Mullen. It is considered a fundamental skill in skateboarding, needed to leap onto, over, or off of obstacles.\n"
            },
            {
                "id": "freestyle-pogo",
                "trickName": "Pogo",
                "trickDescription": "A trick in which the skateboard is used like a pogo stick. The board is held vertical against the boarder's legs, with one foot on the bottom truck and one or both hands holding the nose to lift the board up as the rider hops. It can also be done by squeezing the board between both legs in a no-handed variant, or stood with one foot on the truck and the other crossed over behind it with the toes of that foot pushing against the griptape for a cross-footed pogo.\n"
            },
            {
                "id": "freestyle-primo-slide",
                "trickName": "Primo Slide",
                "trickDescription": "This trick requires balancing like a Railstand but is done while moving, with the side of the board sliding along the ground. Invented by Primo Desiderio, the original version involved sliding backside 180 degrees, but many skaters now hold them in a straight line, flipping into and out of them.\n"
            },
            {
                "id": "freestyle-coconut-wheelie-coco-slide",
                "trickName": "Coconut Wheelie, Coco Slide",
                "trickDescription": "A Coconut Wheelie or Coco Slide is like a Primo Slide but the deck never touches the ground, instead being held in a Wheelie on the side. This trick was invented by coach Vince W.[1] Variations include handstands, grabs, transfer to spacewalk, etc.\n"
            },
            {
                "id": "freestyle-calf-wrap-(flamingofigure-four)",
                "trickName": "Calf Wrap (Flamingo/Figure Four)",
                "trickDescription": "A trick in which the skater uses one foot to wrap the board around the calf of their opposite leg, which is planted on the ground, then unwraps it to land in a riding position. An earlier version of this trick was called \"Flamingo\" or \"Figure Four\" for the stance of the legs in mid-trick, with the board touching the inside knee or thigh. This was not often used until the faster calf-wrap version was developed to accommodate a backside 180 re-entry on banks and ramps. The trick was invented by Derek Belen, and developed and popularized by Mike Vallely, Rey Gregorio, Dorian Tucker and Kris Markovich.\n"
            },
            {
                "id": "freestyle-manual",
                "trickName": "Manual",
                "trickDescription": "A Manual is a trick similar to a bicycle wheelie where the skateboarder balances with only the front or the back wheels touching the ground. Manuals can be done with either or both feet or on a single wheel. A Manual in which both feet are straight on the nose is called a Hang Ten; its tail counterpart is called a Heelie. English Manuals place the back foot at the back bolts and the front foot underneath the nose, hooking the board up until balance is achieved. The Swedish Manual (likely named after Stefan \"Lillis\" Akesson) places the front foot on the nose pointing forward and the back toes are used to hook the tail up in a Nose Manual.\n"
            },
            {
                "id": "freestyle-impossible",
                "trickName": "Impossible",
                "trickDescription": "In an Impossible, the board wraps vertically over the back foot in a 360-degree rotation. An early version of the trick (now called a Nosehook Impossible) involved hooking the front foot under the nose to lift the board before the back foot began its scoop; later, Rodney Mullen developed the technique by popping in an Ollie from a regular riding position. There are many variations of both the Nosehook Impossible and the Ollie Impossible. Darryl Grogan was the first to land Impossibles Crossfooted, Halfcab, and to make a one-foot landing, while Mullen has done many variations off the nose, known as Nollie Impossibles.\n"
            },
            {
                "id": "freestyle-broken-fingers",
                "trickName": "Broken Fingers",
                "trickDescription": "This is a Half Truckhook Impossible caught in a 50/50. The rider stands on the tail, puts the front foot under the board, and jumps backwards while scooping the board in front. This will cause the board to flip upside-down. The rider catches the tail of the board with the front hand and lands with the foot which was under the board on the truck. This trick got the name \"Broken Fingers\" due to the danger involved: failing to jump high enough or lean back sufficiently on the landing can result in crushed fingers. A no-handed version of this trick is referred to as a crossfooted Half Truckhook Impossible caught into a No-Handed 50/50.\n"
            },
            {
                "id": "freestyle-casper-disaster",
                "trickName": "Casper Disaster",
                "trickDescription": "Also invented by Bobby \"Casper\" Boyden, this trick has no relation to the Casper stance. While rolling fakie or nollie, the skater enters a Heelside Railstand one footed. The foot that is not touching the wheel will point down and nudge the griptape side of the skateboard while the rider spins 180 degrees towards the direction of the trucks. After the board and rider have rotated 180 degrees, the feet work together to nudge the skateboard down into a rolling position.\n"
            },
            {
                "id": "freestyle-carousel",
                "trickName": "Carousel",
                "trickDescription": "This is a specific truck-to-truck transfer, which may be considered as a half Impossible from a 50/50 to a switch 50/50 – still standing on the back foot. The rider starts from a 50/50, \"throws\" the board over the foot that stands on the truck and jumps up. When the board has done the \"half wrap\", the rider lands on the truck and catches the nose of the board with the same hand used to flip it. In 2014, Marco Sassi became the first person to do a 360 Carousel, completing a full impossible around the foot to land back in the original 50/50 position. (By July 2015[needs update] only two other freestylers have accomplished this.)\n"
            },
            {
                "id": "freestyle-fan-flip",
                "trickName": "Fan Flip",
                "trickDescription": "A Fan Flip begins from a Pogo stance. The rider jumps up, fingerflips (typically with the front hand), and kicks to the side, landing on the truck in a Pogo stance (usually on the same side).\n"
            },
            {
                "id": "freestyle-gingersnap",
                "trickName": "Gingersnap",
                "trickDescription": "While in a Hang Ten (Manual) position, the skater pops down on the nose, causing the board to do a Nollie Hardflip motion, traveling vertically between the riders legs and landing back in normal position. If the half flip is done with a Nosegrab, the trick is referred to as a Hazze Flip, named for Hazze Lindgren.\n"
            },
            {
                "id": "freestyle-godzilla-flip",
                "trickName": "Godzilla Flip",
                "trickDescription": "This trick involves standing with one foot on the board in Tailstop and spinning the board in an Impossible around that foot with a hand. Either foot and either hand can be used, but neither foot should touch the ground. Not to be confused with the Godzilla Railflip, which is a Triple Varial Railflip with a Body Varial.\n"
            },
            {
                "id": "freestyle-helipop",
                "trickName": "Helipop",
                "trickDescription": "A backside 360 Nollie, performed by beginning a pivot just before initiating a Nollie, with the front foot on the nose of the board and the back foot in Nollie Heelflip position. Invented by Rodney Mullen. If a full 360 cannot be achieved, the rider may recover by landing in a 270 and pivoting the rest of the way on the back wheels. Variations: grabs, frontside, flips out.\n"
            },
            {
                "id": "freestyle-m-80",
                "trickName": "M-80",
                "trickDescription": "This trick begins with a Kickflip, turning the rider's body in the air to catch the board with the back foot on the nose, pivoting 180 degrees on the front wheels before the back wheels hit the ground. It was invented by Matt Barden in 1980. Many variations have been developed, including a Nose M-80 (which omits the body varial and lands the front foot on the nose), fakie and double flip versions.\n"
            },
            {
                "id": "freestyle-no-comply",
                "trickName": "No Comply",
                "trickDescription": "In this trick the front foot slides off the side of the board, with the body weight on the back foot over the tail; the board then snaps upwards and the rider jumps, guiding the board with the back leg or knee, and returns the front foot into contact with the board. This trick has many variations, including 180, 360, Varials, Flips, Fingerflips, Impossibles, etc. Ray Barbee is noted as a master of No Comply variations to many who have watched the earlier Powell videos.\n"
            },
            {
                "id": "freestyle-ollie-airwalk",
                "trickName": "Ollie Airwalk",
                "trickDescription": "This trick is a combination of an Ollie with an Airwalk.[clarification needed] The rider initiates an Ollie and grabs the board with the front hand, while kicking the front foot forward and the back foot backwards (diagonal to the riding direction). This trick was invented by Rodney Mullen, and has many variations, including fingerflips and 180 spins.\n"
            },
            {
                "id": "freestyle-pressure-flip",
                "trickName": "Pressure Flip",
                "trickDescription": "This is a flip using only one foot (either), with the board launched into the air and flipped with one motion. Like Ollie Flips, Pressure Flips can be done nollie or fakie in any combination of flipping and rotational directions. The trick most commonly spins backside, flipping in a heelflip direction, resulting in something similar to an Inward Heelflip.\n"
            },
            {
                "id": "freestyle-san-francisco-flip",
                "trickName": "San Francisco Flip",
                "trickDescription": "The San Francisco Flip is a type of a Truck-To-Transfer where the rider enters a No-Handed 50/50 and does a No-Handed Carousel to a Crossfoot No-Handed 50/50. Invented by Guenter Mokulys.\n"
            },
            {
                "id": "freestyle-saran-wrapwrap-around",
                "trickName": "Saran Wrap/Wrap Around",
                "trickDescription": "Invented by Rodney Mullen, and usually done from a Pogo or a 50/50, this trick involves the front leg tracing a circle around the nose of the board without touching the ground. Experienced skaters can do several Saran Wraps continuously.\n"
            },
            {
                "id": "freestyle-scarewalk",
                "trickName": "Scarewalk",
                "trickDescription": "A scarewalk is a back-handed Airwalk,[clarification needed] resulting in the board being held in close proximity to the rider's crotch (hence the name). It is sometimes erroneously thought to merely be an Airwalk with the legs kicked in the opposite direction.[citation needed]\n"
            },
            {
                "id": "freestyle-sidewinder",
                "trickName": "Sidewinder",
                "trickDescription": "A truck-to-truck transfer where the rider switches from a pogo on one truck to a pogo on the other truck with the board upside-down throughout. During the trick, the board turns over about 90 degrees. Variations: switch foot, same foot and flips.\n"
            },
            {
                "id": "freestyle-spacewalk",
                "trickName": "Spacewalk",
                "trickDescription": "Another kind of \"Walk\" in freestyle skateboarding. The rider enters a Manual on two wheels and swings the other end of the board from side-to-side; the other set of wheels should not touch the ground during the trick. The wider the swing, the better the Spacewalk looks. The Many variations exist including Nose Spacewalks, Hang Ten Spacewalks, Backward Spacewalks, One-Knee-Kneeled Spacewalks (invented by Günter Mokulys) and many more.\n"
            },
            {
                "id": "freestyle-tv-stand",
                "trickName": "TV Stand",
                "trickDescription": "A TV Stand is a handstand done in a 50/50. While in a 50/50 or Pogo, the rider grabs the bottom truck (the one with the back foot on) and performs a handstand with the other hand holding the nose of the board. The trick is landed by doing a half flip. A variation when grabbing the top truck is called a \"Jawbreaker\", invented by Primo Desiderio.\n"
            },
            {
                "id": "freestyle-varial-kickflipheelflip",
                "trickName": "Varial kickflip/heelflip",
                "trickDescription": "A kickflip or heelflip with a twist; the kickflip is combined with a backside shove-it, and a heelflip is combined with a frontside one.\n"
            },
            {
                "id": "freestyle-daffy",
                "trickName": "Daffy",
                "trickDescription": "This trick is done with two boards, one foot in a tailwheelie on one board and the other foot on the second board in a nosewheelie.[2] It is one of the oldest freestyle tricks and has been featured in the Girl Skateboards video Yeah Right!, Gus Van Sant's film Paranoid Park, and the Lords of Dogtown movie. The Tony Hawk's Underground game calls this a Yeah Right Manual.\n"
            }
        ]
    },
    {
        "categoryId": "flip",
        "category": "Flip",
        "tricks": [
            {
                "id": "flip-finger-flip",
                "trickName": "Finger flip",
                "trickDescription": "A finger flip requires the skateboarder to flip the board in any direction using their fingers on the nose or tail; the first ollie finger flip was invented by Mullen in 1986.[23] Mullen has been filmed executing finger flip 360-flips and Tony Hawk executed the first finger flip in 'vert' skateboarding (skateboarding on ramp structures that consist of vertical transition).[24][25]\n"
            },
            {
                "id": "flip-original-kickflip",
                "trickName": "Original kickflip",
                "trickDescription": "This was the first version of the kickflip, whereby the rider hooks one foot under the board to create the flipping motion. Mullen explained to Canadian magazine, SBC Skateboarding:\n"
            },
            {
                "id": "flip-kickflip",
                "trickName": "Kickflip",
                "trickDescription": "When a skateboarder flips the board 360 degrees on its horizontal axis by flicking the corner of the board towards the backside of the skater—the trick was invented by Mullen in 1982 in a Floridian farmhouse.[1][23][26][27] Instances of multiple spins are named according to how many spins are completed (e.g. double kickflip,[28] triple kickflip, etc.)—professional skateboarder Daewon Song was filmed in 2010, performing both a double and triple kickflip, in a web video entitled \"Daewon Dorking Around at DVS\".[29]\n"
            },
            {
                "id": "flip-heelflip",
                "trickName": "Heelflip",
                "trickDescription": "Similar to a kickflip, the heelflip is instead executed with the heel section flipping away from the skater this time. For a regular-footed skater (left foot in front) the board spins clockwise from the perspective of a view from behind the skater. Again, a kick formulates part of the ollie, but unlike the kickflip, the kick is directed forward and outwards, away from the rider's toe side (diagonal), so that the last part of the foot to leave the board is the heel—hence the name. The trick was invented by Mullen in 1982.[23][30] Instances of multiple spins are named according to how many spins are completed (e.g. double heelflip, triple heelflip, etc.)—skateboard videographer, Jon Fistemanu, is filmed executing a double heelflip in a 2010 web video entitled \"Daewon Dorking Around at DVS\".[29]\n"
            },
            {
                "id": "flip-frontsidebackside-180-kickflip",
                "trickName": "Frontside/Backside 180 kickflip",
                "trickDescription": "A kickflip combined with a frontside or backside 180-degree ollie—the trick is also known as a frontside or backside flip. The backside 180 kickflip was invented by Mullen in 1984.[23][31][32] Professional skateboarder Andrew Reynolds performed a frontside kickflip for the \"Trickipedia\" section of The Berrics website.[33] Professional skateboarder (and co-owner of The Berrics) Steve Berra performed a backside kickflip for the \"Trickipedia\" section of his website.[34] Multiple spins can also be incorporated into this trick and a frontside 180 double kickflip was filmed for the \"Skateology\" web-based video series.[35]\n"
            },
            {
                "id": "flip-frontsidebackside-heelflip",
                "trickName": "Frontside/Backside heelflip",
                "trickDescription": "A heelflip combined with a frontside or backside 180-degree movement—the trick is also known as a frontside or backside \"heel\".[36] Song is filmed performing a frontside heelflip on a transitional structure located on the back of a truck in a web-based video entitled \"DVS Daewon x Almost Love Child\".[37]\n"
            },
            {
                "id": "flip-late-kickflip",
                "trickName": "Late kickflip",
                "trickDescription": "A late flip is a kickflip executed in a secondary motion, using your front or back foot, after or at the peak of an ollie—this is different from the one fluid motion that is involved with the execution of an ollie.[38][39][40] Professional skateboarder Mike Mo Capaldi used a late flip variation in his heat against Shane O'Neill in the \"Battle at the Berrics V\" competition.[41]\n"
            },
            {
                "id": "flip-ollie-impossible",
                "trickName": "Ollie impossible",
                "trickDescription": "An \"ollie impossible\" involves the vertical 360-degree rotation of the board around the skater's back or front foot—the board rolls around the foot similar to the spinning of a baton around one's hand. A proficient ollie impossible is executed when the rotation of the board is as vertical as possible, whereby the board wraps around the foot.[42] When the trick is executed with the front foot, the trick is named a \"front-foot impossible\". In a \"trick tip\" video presented by professional skateboarder Lee Yankou, the trick is described as a \"scooping motion\", rather than a trick that is launched with the execution of an ollie.[43]\n"
            },
            {
                "id": "flip-ollie-impostermo-flipmanhatan-flip",
                "trickName": "Ollie Imposter/Mo flip/Manhatan flip",
                "trickDescription": "This flip trick variation involves the execution of a back-foot ollie impossible (the board wrapping 360 degrees around your back foot), followed by a flipping of the board, also with the back foot, as part of the same motion. The trick is also called the \"Mo flip\" because it was popularized by professional skateboarder Mike Mo Capaldi. The original name is “Manhatan flip” by MajadaCLN, a no professional skateboarder [48] [49]\n"
            },
            {
                "id": "flip-front-foot-impossible-bigger-spinmerlin-twist",
                "trickName": "Front-foot impossible bigger spin/Merlin twist",
                "trickDescription": "Professional skateboarder Chris Haslam was filmed performing this trick in slow motion and the footage was published on the Internet-based RIDE Channel.[50] Haslam performs the trick while adopting his natural stance (goofy), but when the trick is performed \"switch\" it is called a \"Merlin twist.\"[51]\n"
            },
            {
                "id": "flip-varial-kickflip",
                "trickName": "Varial kickflip",
                "trickDescription": "A varial kickflip (also known as a kickflip shuvit or 180 flip) is a kickflip combined with a backside-pop shuvit.[52][53] The trick featured prominently in the Blueprint video The First Broadcast and the trick has received a significant amount of criticism from within the skateboard community; former Blueprint rider Mark Baines has stated in an online interview:\n"
            },
            {
                "id": "flip-varial-heelflip",
                "trickName": "Varial heelflip",
                "trickDescription": "A \"varial heelflip\" (originally known as a \"heelflip shuvit\"[55]) is a heelflip combined with a frontside pop shuvit.[20][56][57] Professional skateboarders Chico Brenes and Moose (the latter filmed the high-definition (HD) version)[58] filmed the trick for the \"Trickipedia\" section of The Berrics website.[59] The official name of the trick in the 21st century was a point of contention among skateboarders; the issue was discussed on The Berrics website in early March 2013 in a short video segment entitled \"Name Game\" and the \"varial heelflip\" title emerged as the favored name.[55]\n"
            },
            {
                "id": "flip-360-varial-kickflip360-fliptre-flip",
                "trickName": "360 Varial Kickflip/360 flip/Tre flip",
                "trickDescription": "A combination of a 360-degree backside-pop shuvit and a kickflip.[60][61] Also known as a tre flip. Professional skateboarders such as Josh Kalis, Capaldi, Ethan Fowler, Jason Lee, and Stefan Janoski have been recognized for their 360 flips.[62][63][64][65] The trick was invented by Mullen in 1983.[23]\n"
            },
            {
                "id": "flip-fakie-bigspin-heelfliprick-fliphoward-heel",
                "trickName": "Fakie bigspin heelflip/Rick flip/Howard heel",
                "trickDescription": "A combination of a fakie laser flip (360 Heelflip) and a frontside half-cab. The invention of this trick has been credited to professional skateboarder Rick Howard; however, Howard has publicly stated that he does not appreciate the recognition, as he does not believe that he is the trick's inventor.[71][72] Song has executed the trick numerous times during the period from 2011 to early 2013 (X Games Real Street, 5-Incher, 5-Incher B-Side Edit, \"iFun\" web clip, and \"Who Is Daewon Song?\").[73][74][75][76][77] Early in his career, Song also performed the trick on transition without the tail hitting the ground—as is usually the case in skateboarding—and the trick also appears in his World Industries Love Child video part.[78][79]\n"
            },
            {
                "id": "flip-hardflip",
                "trickName": "Hardflip",
                "trickDescription": "A hardflip combines a frontside pop shuvit with a kickflip. This trick is awkward to execute, and the board sometimes appears to move vertically through the legs—the degree of verticality is determined by the front-foot action.[80] The first hardflip to be captured on film was in the World Industries Love Child video and was executed by Daewon Song—Song stated in an online interview:\n"
            },
            {
                "id": "flip-360-hardflip",
                "trickName": "360 hardflip",
                "trickDescription": "A 360 frontside pop shuvit combined with a \nkickflip. Professional skateboarder Jimmy Carlin was filmed executing a 360 hardflip down a set of stairs in the video Capital Motion.[88] American skateboarder Robbyn Spangler-Magby (amateur) has also been filmed executing the trick—at 1,000 frames per second with a Redlake N3 high speed camera—for the Skateology web-based video series.[89]\n"
            },
            {
                "id": "flip-ghetto-bird",
                "trickName": "Ghetto bird",
                "trickDescription": "A nollie hardflip late backside 180 (often mistakenly thought of as a hardflip late backside 180), this trick was popularized by Kareem Campbell with his only performance of it on transition in Issue 30 of 411 Video Magazine covering September-October 1998.[90][91]\n"
            },
            {
                "id": "flip-diamond-flip",
                "trickName": "Diamond flip",
                "trickDescription": "A hardflip with backside 360-degree body rotation—the trick has been credited to Spangler-Magby.[92]\n"
            },
            {
                "id": "flip-laser-flip-360-heel",
                "trickName": "Laser flip / 360 Heel",
                "trickDescription": "A flip trick in which a frontside 360 shuvit is combined with a heelflip (also known as frontside 360 shove-it heel flips)—the trick was invented by Mullen.[93][94] Professional skateboarder Torey Pudwill has been recognized for his laser flips[95][96] and he performed the trick for the \"Trickipedia\" section of The Berrics website.[97] Double laser flips have also been performed.[98]\n"
            },
            {
                "id": "flip-inward-heelflip",
                "trickName": "Inward heelflip",
                "trickDescription": "A backside-pop shuvit (180 degree) combined with a heelflip. Flow skateboarder James Espinoza was filmed performing a fakie variation on The Berrics website.[42]\n"
            },
            {
                "id": "flip-nollie-inward-heelflip",
                "trickName": "Nollie inward heelflip",
                "trickDescription": "An inward heelflip executed at the front of the board in the nollie position.[99] Professional skateboarder Bryan Herman performs the trick in a promotional video clip for his signature model shoe the Emerica \"G6\", and professional skateboarder Chris Cole was filmed executing a nollie inward heelflip at the Woodward facility in Egypt in 2010.[100][101] Professional skateboarder Lenny Rivas filmed a \"Trick Tip\" for CCS TV (Internet video channel for the CCS online retail outlet) in December 2012.[102]\n"
            },
            {
                "id": "flip-360-inward-heelflip",
                "trickName": "360 Inward Heelflip",
                "trickDescription": "A backside 360 shuvit combined with a heelflip.[citation needed]\n"
            },
            {
                "id": "flip-inward-double-heelflip",
                "trickName": "Inward double heelflip",
                "trickDescription": "An inward heelflip with two heelflip rotations. Unsponsored skateboarder Carell Harvey was filmed, with a Redlake N3 high-speed camera at 1,000 frames per second, performing the variation in 2011.[103]\n"
            },
            {
                "id": "flip-360-inward-double-heelflip",
                "trickName": "360 inward double heelflip",
                "trickDescription": "A 360 inward double is a 360 inward heelflip with two heelflip rotations.[citation needed]\n"
            },
            {
                "id": "flip-backside-bigspin-heelflipbigspin-inward-heelflipbig-inward-heel",
                "trickName": "Backside bigspin heelflip/Bigspin inward heelflip/Big Inward Heel",
                "trickDescription": "A bigspin inward heel is a 360-degree inward heelflip with a 180-degree body rotation in the same direction. It is believed that pro-skater Tom Stano created this trick in an early 1980s skating video.[citation needed]\n"
            },
            {
                "id": "flip-360-degree-kickflipheelflip",
                "trickName": "360-degree kickflip/heelflip",
                "trickDescription": "The skateboarder's body spins 360 degrees in the same direction as the board during a kickflip. Professional skateboarder Paul Rodriguez finished in second place in \"The Battle of the Berrics 2\" (contest) to Cole, as he was unable to execute the 360-degree kickflip.[104]\n"
            },
            {
                "id": "flip-backside-bigspin-kickflip-backside-bigflip-bigflip",
                "trickName": "Backside Bigspin Kickflip / Backside Bigflip / Bigflip",
                "trickDescription": "A bigflip is a 360 flip combined with a backside 180-degree body rotation. Rodriguez executes a bigspin down a set of stairs in the final scene of the Nike \"#skateeverydamnday\" commercial that was filmed in China in 2012.[105] Professional skateboarder Mark Appleyard performed the trick for \"Trickipedia\" section of The Berrics website.[106]\n"
            },
            {
                "id": "flip-bigger-flip",
                "trickName": "Bigger flip",
                "trickDescription": "A 540-degree flip with a 180-degree body rotation (when a 360-degree body rotation is executed, the trick is known as a \"Gazelle flip/360 Bigspin\").[107]\n"
            },
            {
                "id": "flip-biggest-flip",
                "trickName": "Biggest flip",
                "trickDescription": "A 720 flip with a 180-degree backside rotation of the body (when the board spins 720 degrees, does one flip and your body does a 180 degree rotation the same way your board does). Invented and landed by Sewa Kroetkov and filmed by Chris Chann.[citation needed]\n"
            },
            {
                "id": "flip-bigspin-heelflipbig-heel",
                "trickName": "Bigspin heelflip/Big heel",
                "trickDescription": "A Laser flip combined with a frontside 180-degree body rotation in the same direction. Amateur skateboarder Felipe Gustavo performs a switch version for the \"Trickipedia\" section of The Berrics website.[108]\n"
            },
            {
                "id": "flip-grape-flip",
                "trickName": "Grape flip",
                "trickDescription": "A hardflip with a frontside 360-degree body rotation.[109] The double grape flip consists of two hardflips and the 360-degree body rotation—the double variation was invented by Donovan Strain.[110]\n"
            },
            {
                "id": "flip-underflip",
                "trickName": "Underflip",
                "trickDescription": "Flipping the board by using one foot that is under the board and flipping it in the kickflip or heelflip direction—this trick was invented by Mullen in 1992.[23] While skateboarding on the Hollywood Walk of Fame, Mullen performs numerous variations of this flip trick in his Almost: Round Three video part.[22][24][111][112]\n"
            },
            {
                "id": "flip-pop-shuvit-underflip",
                "trickName": "Pop shuvit underflip",
                "trickDescription": "A shuv-it, with a late underflip performed by the back foot. While professional skateboarders rarely perform this trick, numerous segments of home video footage, in which unsponsored skateboarders perform the trick, has been published on the Internet.[113][114][115]\n"
            },
            {
                "id": "flip-casper-flip-(flatground)",
                "trickName": "Casper flip (flatground)",
                "trickDescription": "The rider uses the same pressure that would be applied if he/she is attempting to adopt a \"primo\" position (when the board is positioned on its side/edge[116]); however, one foot is placed under the board so that the board is not completely in a \"dark\" position (when the board is upside down, with the griptape facing the ground).[117] The other foot is then placed on the tail of the board when the board is upside down—the foot beneath the board is then used to scoop the board up, and then around. The rider then jumps onto the board to land in the starting position.[118] Mullen invented the Casper 360 flip in 1983.[23]\n"
            },
            {
                "id": "flip-dark-casper-flip-(flatground)",
                "trickName": "Dark casper flip (flatground)",
                "trickDescription": "A flatground trick performed without touching the floor. Starting in a normal stance, the rider uses backfoot pressure to flip the board into the \"dark\" position, standing on the underside of the board's tail and nose with either foot. Then, in one swift movement, the skateboarder applies pressure to the side of the board, with either foot lifting up onto the opposite side of the board. The skateboarder then uses the other foot to scoop the board over and around, while jumping to land back on the right side of the board.[citation needed]\n"
            },
            {
                "id": "flip-nollie-casper-flip",
                "trickName": "Nollie casper flip",
                "trickDescription": "A nollie casper flip is a half-nollie flip that is caught upside down, with the front foot under the front trucks; the board is then flipped back over, heelflip-style, with a combined pop shuvit action.[119]\n"
            },
            {
                "id": "flip-casper-heelhospital-heelscissor-flipflower-flip",
                "trickName": "Casper heel/Hospital heel/Scissor flip/Flower Flip",
                "trickDescription": "This flip trick is a half-heelflip—the front foot catches the board upside down—combined with a backside shuvit.[citation needed]\n"
            },
            {
                "id": "flip-twisted-flip",
                "trickName": "Twisted flip",
                "trickDescription": "A kickflip or heelflip shuvit with a 180-degree body rotation in the opposite direction to the rotation of the board.[120]\n"
            },
            {
                "id": "flip-nightmare-flipdouble-kickflip-shove-it",
                "trickName": "Nightmare flip/Double kickflip shove-it",
                "trickDescription": "A nightmare flip is a varial kickflip with an extra kickflip rotation. Also known as varial double kickflip[121]\n"
            },
            {
                "id": "flip-hospital-flip",
                "trickName": "Hospital flip",
                "trickDescription": "A Hospital flip consists of two separate motions: firstly, the skateboarder performs a kickflip but stalls the rotation of the board at the halfway point; the front foot then executes an upward flick that causes the board to spin 180 degrees along the longitudinal axis.[122]\n"
            },
            {
                "id": "flip-alpha-flip",
                "trickName": "Alpha flip",
                "trickDescription": "Footage of an alpha flip is provided in a YouTube tutorial by Cotton Mouth Skateboards that features a skateboarder combining a backside 180 with a 360-degree hospital flip of the board around the front foot. The tutorial states: \"The front foot never leaves the board(Its easier this way. However, it is a hospital flip, not an impossible, so it may).\"[123]\n"
            },
            {
                "id": "flip-beta-flip",
                "trickName": "Beta flip",
                "trickDescription": "Footage of both a regular beta flip and fakie beta flip were published on the Cotton Mouth Skateboards YouTube channel in 2012 and 2010, respectively. In the 2010 video clip, the skateboarder describes a fakie beta flip as, \"a fakie backside 360 while you do an alpha flip\";[124] thus, a beta flip can be described as a backside 360 with a 360-degree rotation of the board around the front foot.[123]\n"
            },
            {
                "id": "flip-dolphin-flipmurder-flipforward-fliphorse-flip",
                "trickName": "Dolphin flip/Murder flip/Forward flip/Horse flip",
                "trickDescription": "Performed by pushing with the front foot directly off the nose of the board after an ollie, causing the board to rotate almost vertically 180 degrees towards the frontfoot between the rider's legs while flipping the board 180 degrees so it lands wheels down. Carlin has described the trick as \"Pretty much a varial flip that goes down.\"[125][126] The trick was invented by Darrell Stanton.[citation needed]\n"
            },
            {
                "id": "flip-360-dolphin-dragon-flip360-forward-flip",
                "trickName": "360 Dolphin /Dragon flip/360 Forward flip",
                "trickDescription": "A dolphin/forward flip with a 360-degree rotation. It was named the \"Reda flip\" by Moroccan skateboarder Reda Hadada. Two days after he landed the trick, Chris Chann also landed it. He was inspired by Hadada's video and changed the name to Dragon flip for his YouTube series \"Trick Challenge\" (episode 11) in April 2014. Chann got the idea for the name from the anime television series Dragon Ball Z, which he had been watching the night before filming.[127]\n"
            },
            {
                "id": "flip-dolphin-heelporpoise-flipforward-heelflip",
                "trickName": "Dolphin heel/Porpoise flip/Forward heelflip",
                "trickDescription": "A forward flip combined with a heelflip.[citation needed]\n"
            },
            {
                "id": "flip-inward-flip",
                "trickName": "Inward flip",
                "trickDescription": "For an inward flip, the board rotates in the same manner as an \"inward heelflip\", but the board is flipped from under the board with the front foot. This trick is easiest in the nollie position and is considered the complete opposite of a \"nerdflip\". Due to the awkward foot positioning required for an inward flip, the flip trick is typically performed by advanced skateboarders. The trick was invented by Mullen.[citation needed]\n"
            },
            {
                "id": "flip-gazelle-flip-360-bigspin-kickflip",
                "trickName": "Gazelle flip/ 360 Bigspin Kickflip",
                "trickDescription": "A flip trick in which a 540-degree board flip is combined with a 360-degree body rotation in the same direction. So basically a big flip (big spin with kickflip) then immediately after landing 180 pivot. The trick was invented by Mullen in 1981.[23][107]\n"
            },
            {
                "id": "flip-kickflip-underflip",
                "trickName": "Kickflip Underflip",
                "trickDescription": "This trick is performed like a kickflip, but after the board has made the full kickflip rotation, the front foot flips the board back in the opposite direction like a heelflip from the underside of the board. It is essentially a kickflip with a late front foot underflip.[128]\n"
            },
            {
                "id": "flip-toe-flip",
                "trickName": "Toe flip",
                "trickDescription": "A pressure varial kickflip.[citation needed]\n"
            },
            {
                "id": "flip-360-toe-flip",
                "trickName": "360 toe flip",
                "trickDescription": "A pressure 360 flip, flipped with the toe of the back foot.[citation needed]\n"
            },
            {
                "id": "flip-semi-flip",
                "trickName": "Semi-flip",
                "trickDescription": "A quarter-kickflip, late back-foot varial heelflip that was invented by Mullen.[citation needed]\n"
            },
            {
                "id": "flip-storm-flip",
                "trickName": "Storm flip",
                "trickDescription": "A nollie backside flip followed by a late kickflip—the trick was invented by Jerry Hsu and was captured in the Osiris shoe company video The Storm.[129] Hsu was filmed performing the trick on transition during the 2009 Zumiez Couch Tour.[130]\n"
            },
            {
                "id": "flip-sigma-flip",
                "trickName": "Sigma flip",
                "trickDescription": "A one and a half varial kick-flip (almost a nightmare flip)  that transitions into an anti-Casper flip in a single motion.[citation needed]\n"
            },
            {
                "id": "flip-haslam-flip",
                "trickName": "Haslam flip",
                "trickDescription": "A half kick flip shuv-it that transitions into a half late heel flip in a single motion—the trick is named after its inventor, professional skateboarder Chris Haslam.[131]\n"
            },
            {
                "id": "flip-hectop-flip",
                "trickName": "Hectop flip",
                "trickDescription": "Invented by Haslam, the name of the trick is taken from the Russian (Cyrillic)  version of the name of fellow professional skateboarder Nestor Judkins (sponsored by Enjoi skateboards, Krux trucks, RVCA clothing, and adidas footwear[132][133][134]). The trick is a switch, half frontside flip to back foot bigspin flip. In his online introduction of the truck for sponsor, Strange Notes (Independent Trucks), Haslam explained:\n"
            },
            {
                "id": "flip-unnamed-haslam-flip-trick",
                "trickName": "Unnamed Haslam flip trick",
                "trickDescription": "Haslam also invented a switch flip trick that, as of 2012, had not been named. The trick was filmed for the Strange Notes company under the title, \"Chris Haslam Crazy Ass trick\".[136]\n"
            },
            {
                "id": "flip-hang-ten-flipgingersnap",
                "trickName": "Hang ten flip/Gingersnap",
                "trickDescription": "The rider is in a \"hang ten\" position and then pops the board down, resulting in a pressure nollie hardflip through the rider's legs.[citation needed]\n"
            },
            {
                "id": "flip-handstand-flip",
                "trickName": "Handstand flip",
                "trickDescription": "This flip trick can be executed while rolling along or in a stationary position. The skateboarder can either start on the board or on the ground (if the board is rolling, the skateboarder usually hops off the board first). The skateboarder places his/her hands on the board and then quickly pulls the board's edge up, causing it to flip, and then the skater lands on the board with both feet.\n"
            },
            {
                "id": "flip-rail-flip",
                "trickName": "Rail flip",
                "trickDescription": "For a rail flip, the skateboarder stands on the side of the board and uses the back foot to flip the board with pressure.[citation needed]\n"
            },
            {
                "id": "flip-railstand-nightmare-flip",
                "trickName": "Railstand nightmare flip",
                "trickDescription": "A Railstand nightmare flip is a double-kick flip shuvit executed from a \"primo\" position.[137]\n"
            },
            {
                "id": "flip-frightmare-fliptwisted-nightmare-flip",
                "trickName": "Frightmare flip/Twisted nightmare flip",
                "trickDescription": "A Frightmare flip is a nightmare flip with a frontside 180-degree body rotation.[138]\n"
            },
            {
                "id": "flip-no-comply-flips",
                "trickName": "No comply flips",
                "trickDescription": "A \"no comply\" is a trick where the skater plants his/her foot, and then uses the back foot and knee to lift the board off the ground. It is a freestyle trick that can be combined with pressure flips, finger flips, and spins.[citation needed] In 2011, a no comply frontside bigspin heelflip was filmed by the Skateology web-based video series.[139]\n"
            },
            {
                "id": "flip-no-comply-pressure-flip",
                "trickName": "No-comply pressure flip",
                "trickDescription": "A trick whereby the front foot is planted on the ground and a pressure flip is then performed in one motion. This flip trick usually involves running and catching the board with front foot.[citation needed]\n"
            },
            {
                "id": "flip-tucker-flipbigspin-flip-180",
                "trickName": "Tucker flip/Bigspin flip 180",
                "trickDescription": "A bigspin kickflip, whereby the skateboarder's body transitions into a fakie backside 180 after the bigspin kickflip has completed its rotation.[citation needed]\n"
            },
            {
                "id": "flip-illusion-flipmuska-flip",
                "trickName": "Illusion flip/Muska flip",
                "trickDescription": "A flip trick in which the board flips in a similar fashion to a frontside kickflip, but the action of the front foot is absent—the flip of the board is reliant upon the pushing down action of the back foot. Aaron \"Jaws\" Homoki has filmed a \"Trick Tip\" video for the RIDE Channel on YouTube, in which he commends professional skateboarder Chad Muska for his execution of the trick. Muska has received broader recognition for his execution of the trick and it is, therefore, also called a \"Muska flip\".[141][142][143]\n"
            },
            {
                "id": "flip-psycho-white-boy",
                "trickName": "Psycho white boy",
                "trickDescription": "A late back-foot varial/shuvit flip—the name of the trick was coined by Jimmy Carlin; however, it is unclear who invented the trick.[144]\n"
            },
            {
                "id": "flip-pressure-flip",
                "trickName": "Pressure flip",
                "trickDescription": "Is basically an inward heelflip without the heelflip as it is executed only by the same foot used to pop it up whether on the nose or tail—pressure flips are executed using a scooping technique, rather than the \"popping\" action of ollie-based tricks.[145] In an instructional video, Hawk described the action that underpins the trick as a \"pushing/scooping action, instead of an ollie\" and states that the trick is \"old school\", forgotten by later generations of skateboarders.[146] American skateboard shop owner and former professional skateboarder Nate Sherwood[147][148][149] is well known for a variety of pressure flip tricks, and Sherwood invented the \"Laser pressure flip\".[150]\n"
            },
            {
                "id": "flip-360-pressure-flip",
                "trickName": "360 pressure flip",
                "trickDescription": "A pressure kickflip that rotates 360 degrees .[citation needed]\n"
            },
            {
                "id": "flip-ollie-late-pressure-flip",
                "trickName": "Ollie late pressure flip",
                "trickDescription": "The trick became the second flip trick to be named the \"Mo flip\", as it is a highlight of Capaldi's opening part in Lakai's Fully Flared video,[151] as well as during his finals match against Shane O'neill in the \"Battle Of The Berrics 5\" contest.[152] The trick is later performed against Nyjah Huston in \"Battle At The Berrics 7\" in April 2014.[153]\n"
            }
        ]
    }
]